# Subsetting `DataFrames`

## In this section, we'll cover

* What subsetting is and why it's in important tool for working with data
* How to select specific columns from a `DataFrame`
* How to filter specific rows using conditional expressions
* `pandas` specific syntax for subsetting and filtering data

## What is Subsetting?

One of the most common and fundamental tasks you'll perform while working with data is *subsetting* the data you're working with.  Subsetting is simply the action of focusing in on the pieces of the data that you care about or need to access.  Subsetting isn't something that you'll do just once; you'll often subset your data over and over during the course of an analysis to understand what's in the data, drill into specific pieces of the data, and look for potential data problems (just to name a few).  Becoming an effective subsetter is an important component to becoming a proficient data analyst.

In the case of tabular data (i.e. a `pandas` `DataFrame`), subsetting can be divided into to main categories

* Selecting specific columns
* Filtering to specific rows

In this section, we'll cover both of these case.  But before that, let's load up the penguins data set to work with:

In [1]:
# Remember that  you need to import the pandas package before you can use it
import pandas as pd

# Read the penguins dataset (provideed by Allison Horst)
# https://github.com/allisonhorst/palmerpenguins
penguins = pd.read_csv("https://raw.githubusercontent.com/allisonhorst/palmerpenguins/master/inst/extdata/penguins.csv")

## Selecting Specific Columns with `pandas`

Selecting specific columns from your data is typically used to help focus in on the main pieces of data you care about.  Imagine your data set has 100's of columns, but you only care about a handful of them.  Keeping those additional columns throughout your analysis makes it difficult to review results (i.e. when you print out your data table) and can add additional, unneeded complexity to the problem you're working on.

Another common use case for selecting specific columns is when you want to select a single column of data, and perform some action with it.  For example, you might be interested in the mean value of one of the columns.  Here, you might first *select* that column to get the underlying values, then calculate the mean value.

There are several ways to select a single column from a `DataFrame`, but one of the most useful and straight forward ways is to use the column's name:

In [2]:
# We need to know the column names first!
list(penguins.columns)

['species',
 'island',
 'bill_length_mm',
 'bill_depth_mm',
 'flipper_length_mm',
 'body_mass_g',
 'sex',
 'year']

In [3]:
# Select the species column
# Use the square brackets, [ ], along with a column name
penguins["species"]

0         Adelie
1         Adelie
2         Adelie
3         Adelie
4         Adelie
         ...
339    Chinstrap
340    Chinstrap
341    Chinstrap
342    Chinstrap
343    Chinstrap
Name: species, Length: 344, dtype: object

In [4]:
# Get the unique set of species in the data
penguins["species"].unique()

array(['Adelie', 'Gentoo', 'Chinstrap'], dtype=object)

In [5]:
# Get the maximum body mass
penguins["body_mass_g"].max()

6300.0

It's also possible to select multiple columns at once (e.g. if you want to focus in on only a subset of the columns).  The code syntax is similar to the single column case, but here, we need to first construct a Python list of the column names we're interested, then subset with that instead of the single column name we used before:

In [6]:
# Get just the species, island and body mass
colNamesSelected = ["species", "island", "body_mass_g"]
penguins[colNamesSelected]

       species     island  body_mass_g
0       Adelie  Torgersen       3750.0
1       Adelie  Torgersen       3800.0
2       Adelie  Torgersen       3250.0
3       Adelie  Torgersen          NaN
4       Adelie  Torgersen       3450.0
..         ...        ...          ...
339  Chinstrap      Dream       4000.0
340  Chinstrap      Dream       3400.0
341  Chinstrap      Dream       3775.0
342  Chinstrap      Dream       4100.0
343  Chinstrap      Dream       3775.0

[344 rows x 3 columns]

In practice, you might not always want to created a separate variable of the column names before doing the subsetting.  You can just put the Python list inside the square brackets directly:

In [7]:
penguins[["species", "island", "body_mass_g"]]

       species     island  body_mass_g
0       Adelie  Torgersen       3750.0
1       Adelie  Torgersen       3800.0
2       Adelie  Torgersen       3250.0
3       Adelie  Torgersen          NaN
4       Adelie  Torgersen       3450.0
..         ...        ...          ...
339  Chinstrap      Dream       4000.0
340  Chinstrap      Dream       3400.0
341  Chinstrap      Dream       3775.0
342  Chinstrap      Dream       4100.0
343  Chinstrap      Dream       3775.0

[344 rows x 3 columns]

Note in the code above that we don't have a new "double bracket", `[[`,  operator here.  The inner brackets define the Python list (standardy Python syntax), while the outer brackets are doing the subsetting.

Interestingly, you can also perform operations after selecting multiple columns (or on `DataFrames` generally) like we did for the single column case:

In [8]:
# This code will get the max values for each of the selected columns
mvs = penguins[["bill_length_mm", "bill_depth_mm", "flipper_length_mm", "body_mass_g"]].max()
mvs

bill_length_mm         59.6
bill_depth_mm          21.5
flipper_length_mm     231.0
body_mass_g          6300.0
dtype: float64

In [9]:
# Can also apply to the entire DataFrame
penguins.max()

species                 Gentoo
island               Torgersen
bill_length_mm            59.6
bill_depth_mm             21.5
flipper_length_mm          231
body_mass_g               6300
year                      2009
dtype: object

## Filtering Specific Rows

Subsetting to specific rows is similar in spirit to selecting columns (i.e. getting entire rows of data vs. getting entire columns of data), but adds an additional powerful feature: the ability to select rows based on the underlying data values.  For column subsetting, we simply used the names of the columns to get a subset.  That's also possible with row subsetting (using a row label), but you can also define the row subsetting based upon conditions in the data.

Image the case where you only want to get the data for the Gentoo species of penguin, or penguins above a certain body mass, or a combination of both.  Row subsetting (filtering) allows you to do that.

There are several ways to filter rows in your data, but one of the most useful is to construct a list *boolean* (true or false) values based on the condition you're interested in.  This list should be exactly the same length as the total number of rows in your data (before filtering), and a value of `true` means to keep that row, and a value of `false` say to get rid of it.

In [10]:
# Get only the Gentoo penguin data
# First make our boolean list, one value for each row in our data noting which are Gentoo
isGentoo = penguins["species"] == "Gentoo"
isGentoo

0      False
1      False
2      False
3      False
4      False
       ...
339    False
340    False
341    False
342    False
343    False
Name: species, Length: 344, dtype: bool

In [11]:
penguins[isGentoo]

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex,year
152,Gentoo,Biscoe,46.1,13.2,211.0,4500.0,female,2007
153,Gentoo,Biscoe,50.0,16.3,230.0,5700.0,male,2007
154,Gentoo,Biscoe,48.7,14.1,210.0,4450.0,female,2007
155,Gentoo,Biscoe,50.0,15.2,218.0,5700.0,male,2007
156,Gentoo,Biscoe,47.6,14.5,215.0,5400.0,male,2007
...,...,...,...,...,...,...,...,...
271,Gentoo,Biscoe,NaN,NaN,NaN,NaN,NaN,2009
272,Gentoo,Biscoe,46.8,14.3,215.0,4850.0,female,2009
273,Gentoo,Biscoe,50.4,15.7,222.0,5750.0,male,2009
274,Gentoo,Biscoe,45.2,14.8,212.0,5200.0,female,2009
275,Gentoo,Biscoe,49.9,16.1,213.0,5400.0,male,2009

Just like in the example above were we selected multiple columns with a Python list inside of the subset brackets, you can also place the conditional expression (which defined the boolean list) directly inside the subsetting brackets:

In [12]:
penguins[penguins["species"] == "Gentoo"]

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex,year
152,Gentoo,Biscoe,46.1,13.2,211.0,4500.0,female,2007
153,Gentoo,Biscoe,50.0,16.3,230.0,5700.0,male,2007
154,Gentoo,Biscoe,48.7,14.1,210.0,4450.0,female,2007
155,Gentoo,Biscoe,50.0,15.2,218.0,5700.0,male,2007
156,Gentoo,Biscoe,47.6,14.5,215.0,5400.0,male,2007
...,...,...,...,...,...,...,...,...
271,Gentoo,Biscoe,NaN,NaN,NaN,NaN,NaN,2009
272,Gentoo,Biscoe,46.8,14.3,215.0,4850.0,female,2009
273,Gentoo,Biscoe,50.4,15.7,222.0,5750.0,male,2009
274,Gentoo,Biscoe,45.2,14.8,212.0,5200.0,female,2009
275,Gentoo,Biscoe,49.9,16.1,213.0,5400.0,male,2009

In [13]:
# Get the penguins greater than 5000 g
penguins[penguins["body_mass_g"] > 5000]

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex,year
153,Gentoo,Biscoe,50.0,16.3,230.0,5700.0,male,2007
155,Gentoo,Biscoe,50.0,15.2,218.0,5700.0,male,2007
156,Gentoo,Biscoe,47.6,14.5,215.0,5400.0,male,2007
159,Gentoo,Biscoe,46.7,15.3,219.0,5200.0,male,2007
161,Gentoo,Biscoe,46.8,15.4,215.0,5150.0,male,2007
...,...,...,...,...,...,...,...,...
267,Gentoo,Biscoe,55.1,16.0,230.0,5850.0,male,2009
269,Gentoo,Biscoe,48.8,16.2,222.0,6000.0,male,2009
273,Gentoo,Biscoe,50.4,15.7,222.0,5750.0,male,2009
274,Gentoo,Biscoe,45.2,14.8,212.0,5200.0,female,2009
275,Gentoo,Biscoe,49.9,16.1,213.0,5400.0,male,2009

Notice that we used the same bracket operator, `[ ]`, that we used with column selection.  `pandas` understands how to deal with these different cases.

It's possible to combine multiple boolean expressions to get more complex filtering.  First, you'll need to wrap each expression in `( )`. Second, you'll need to combine them with boolean operators, `&` and `|`.  Note that you can't use Python keywords `and` or `or` here.

In [14]:
# Get the Gentoo penguins that are greater than 5000g
penguins[(penguins["species"] == "Gentoo") & (penguins["body_mass_g"] > 5000)]

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex,year
153,Gentoo,Biscoe,50.0,16.3,230.0,5700.0,male,2007
155,Gentoo,Biscoe,50.0,15.2,218.0,5700.0,male,2007
156,Gentoo,Biscoe,47.6,14.5,215.0,5400.0,male,2007
159,Gentoo,Biscoe,46.7,15.3,219.0,5200.0,male,2007
161,Gentoo,Biscoe,46.8,15.4,215.0,5150.0,male,2007
...,...,...,...,...,...,...,...,...
267,Gentoo,Biscoe,55.1,16.0,230.0,5850.0,male,2009
269,Gentoo,Biscoe,48.8,16.2,222.0,6000.0,male,2009
273,Gentoo,Biscoe,50.4,15.7,222.0,5750.0,male,2009
274,Gentoo,Biscoe,45.2,14.8,212.0,5200.0,female,2009
275,Gentoo,Biscoe,49.9,16.1,213.0,5400.0,male,2009

One important shortcut to simplifying complex boolean expressions that check if a given value is contained in a specific set of values is to use the `isin` (read as "is in") function:

In [15]:
# Get only the Adelie and Gentoo penguin data
penguins[penguins["species"].isin(["Adelie", "Gentoo"])]

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex,year
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,male,2007
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,female,2007
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,female,2007
3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN,2007
4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,female,2007
...,...,...,...,...,...,...,...,...
271,Gentoo,Biscoe,NaN,NaN,NaN,NaN,NaN,2009
272,Gentoo,Biscoe,46.8,14.3,215.0,4850.0,female,2009
273,Gentoo,Biscoe,50.4,15.7,222.0,5750.0,male,2009
274,Gentoo,Biscoe,45.2,14.8,212.0,5200.0,female,2009
275,Gentoo,Biscoe,49.9,16.1,213.0,5400.0,male,2009

In [16]:
# This is equivalent to the more complex (and verbose) version
penguins[(penguins["species"] == "Adelie") | (penguins["species"] == "Gentoo")]

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex,year
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,male,2007
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,female,2007
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,female,2007
3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN,2007
4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,female,2007
...,...,...,...,...,...,...,...,...
271,Gentoo,Biscoe,NaN,NaN,NaN,NaN,NaN,2009
272,Gentoo,Biscoe,46.8,14.3,215.0,4850.0,female,2009
273,Gentoo,Biscoe,50.4,15.7,222.0,5750.0,male,2009
274,Gentoo,Biscoe,45.2,14.8,212.0,5200.0,female,2009
275,Gentoo,Biscoe,49.9,16.1,213.0,5400.0,male,2009

Another useful filtering operation is to remove rows with missing data.  We can see some of those cases in the table above occuring where values are `NaN`.  There is a function specifically for this task: `notna`

In [17]:
# Only get the data where the body mass is NOT missing
penguins[penguins["body_mass_g"].notna()]

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex,year
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,male,2007
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,female,2007
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,female,2007
4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,female,2007
5,Adelie,Torgersen,39.3,20.6,190.0,3650.0,male,2007
...,...,...,...,...,...,...,...,...
339,Chinstrap,Dream,55.8,19.8,207.0,4000.0,male,2009
340,Chinstrap,Dream,43.5,18.1,202.0,3400.0,female,2009
341,Chinstrap,Dream,49.6,18.2,193.0,3775.0,male,2009
342,Chinstrap,Dream,50.8,19.0,210.0,4100.0,male,2009
343,Chinstrap,Dream,50.2,18.7,198.0,3775.0,female,2009

## Subset Specific Rows and Columns at the Same Time

It's also possible to subset both rows and columns in a single expression, but we'll have to use slightly different syntax since using just the selection brackets, `[ ]` isn't sufficient (recall we used the same selection brackets to subset to columns OR rows).  In this case, we need to use the `loc` or `iloc` operators before the selection brackets, and specify both row and column selections separated by a `,`.  Let's review this with a specific example:

In [18]:
# Get the sexes of the Gentoo penguins greater than 5000 g
penguins.loc[(penguins["species"] == "Gentoo") & (penguins["body_mass_g"] > 5000), "sex"]

153      male
155      male
156      male
159      male
161      male
        ...
267      male
269      male
273      male
274    female
275      male
Name: sex, Length: 61, dtype: object

The `loc` operator is used when you specify selections using column names, row labels, or conditional expressions.

If instead you want to get rows or columns by numeric position in the data (e.g. I want the first 10 rows with the last 3 columns), use `iloc`.

*Reminder: Recall that Python start counting at 0, and the slice operator `:` ranges from the first value inclusive to the last value exclusive.*

In [19]:
# Get the first 10 rows, and all the columns
# if you don't specify the rows (second index of iloc), you get all the columns
penguins.iloc[0:10]

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex,year
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,male,2007
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,female,2007
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,female,2007
3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN,2007
4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,female,2007
5,Adelie,Torgersen,39.3,20.6,190.0,3650.0,male,2007
6,Adelie,Torgersen,38.9,17.8,181.0,3625.0,female,2007
7,Adelie,Torgersen,39.2,19.6,195.0,4675.0,male,2007
8,Adelie,Torgersen,34.1,18.1,193.0,3475.0,NaN,2007
9,Adelie,Torgersen,42.0,20.2,190.0,4250.0,NaN,2007

In [20]:
# Get the first 10 rows and and the last 3 columns
penguins.iloc[0:10, 5:]

   body_mass_g     sex  year
0       3750.0    male  2007
1       3800.0  female  2007
2       3250.0  female  2007
3          NaN     NaN  2007
4       3450.0  female  2007
5       3650.0    male  2007
6       3625.0  female  2007
7       4675.0    male  2007
8       3475.0     NaN  2007
9       4250.0     NaN  2007

While subsetting by location (i.e. with `iloc`) is good to know, your code will often make more sense when subsetting is done using explicit column names and conditional expressions.

## Main Points

* Subsetting is a fundamental data manipulation operation that you'll be doing frequently.
* There are two main types of subsetting with tabular data in `pandas`: selecting specific columns, and filtering specific rows.
* Subsetting is accomplished using selection brackets, `[ ]`.
* Subsetting to specific columns is conveniently done by specifying column names.
* Subsetting to specific rows is often done by specifying a boolean expression (condition).
* You can subset rows and columns at the same time using the `loc` and `iloc` operators.